#include <stdio.h>
#include <math.h>
/**
 * 考虑包含N位数字的K-进制数.
 * 其有以下定义：如果一个数有效, 则其K-进制表示不包含两个连续的0.
 * 例如:
 * 1010230 是有效的7位数
 * 1000198 无效
 * 0001235 不是7位数, 而是4位数.
 * 给定两个数N和K, 要求计算包含N位数字的有效K-进制数的总数.
 * 假设2 <= K <= 10; 2 <= N; 4 <= N+K <= 18.考虑包含N位数字的K-进制数
 * 其有以下定义：如果一个数有效, 则其K-进制表示不包含两个连续的0.
 * 例如:
 * 1010230 是有效的7位数
 * 1000198 无效
 * 0001235 不是7位数, 而是4位数.
 * 给定两个数N和K, 要求计算包含N位数字的有效K-进制数的总数.
 * 假设2 <= K <= 10; 2 <= N; 4 <= N+K <= 18.
*/
void DFS(int s);
int a[20], n, k, i;
int count = 0;
int main(void)
{
    scanf("%d", &n);
    scanf("%d", &k);
    DFS(0);
    printf("%d", count);
    return 0;
}

void DFS(int s)
{
    if (s == n)
    {
        count++;
        return;
    }
    for (i = 0; i < k; i++)
    {
        if ((s == 0 && i == 0) || (s > 0 && i == 0 && a[s - 1] == 0))
            continue;
        a[s] = i;
        DFS(s + 1);
    }
}
